const titles: [number, string][] = [
  [1, "# 目次"],
  [1, "## 第1章 序論"],
  [1, "### 1.1 背景"],
  [1, "### 1.2 本研究の目的"],
  [1, "### 1.3 本論文の構成"],
  [1, "## 第2章 現状の日本語入力システムの整理"],
  [1, "### 2.1 かな漢字変換と IME"],
  [1, "### 2.2 かな漢字変換の課題点"],
  [1, "### 2.3 文節と連文節変換"],
  [1, "### 2.4 連文節変換の問題点"],
  [1, "### 2.5 再変換機能"],
  [1, "## 第3章 システムの提案"],
  [1, "### 3.1 課題解決のための設計"],
  [1, "### 3.2 制作物の紹介"],
  [1, "#### 3.2.1 入力方法とかな漢字変換機能"],
  [1, "#### 3.2.2 変換結果変更機能"],
  [1, "#### 3.2.3 打ち間違い修正機能"],
  [1, "### 3.3 実装方法"],
  [1, "#### 3.3.1 概要"],
  [1, "#### 3.3.2 かな漢字変換機能・変換結果変更機能"],
  [1, "#### 3.3.3 打ち間違い修正機能"],
  [1, "## 第4章 システムの評価と考察"],
  [1, "### 4.1 考察と議論"],
  [1, "#### 4.1.1 打ち間違いを気にせず入力を続ける意識"],
  [1, "#### 4.1.2 スペースによる文節区切りにまつわる問題"],
];

const pagenumSpan = (size, i) => `<span class="right font-mid size-${size}"> ${i} </span>`

let content = ""

for (let title of titles) {
  const [i, str] = title
  const size = str.match(/#+/)[0]?.length || 1
  content += `${str}${pagenumSpan(i, size)}\n\n`
}


const dir = import.meta.url.replace("/index.ts", "")
const dirja = decodeURI(dir).replace("file://", "")
await Bun.write(`${dirja}/index.md`, content)
