const titles: [number, string, string][] = [
  [1, "1", "序論"],
  [1, "1.1", "背景"],
  [1, "1.2", "本研究の目的"],
  [1, "1.3", "本論文の構成"],
  [1, "2", "現状の日本語入力システムの整理"],
  [1, "2.1", "かな漢字変換と IME"],
  [1, "2.2", "かな漢字変換の課題点"],
  [1, "2.3", "文節と連文節変換"],
  [1, "2.4", "連文節変換の問題点"],
  [1, "2.5", "再変換機能"],
  [1, "3", "システムの提案"],
  [1, "3.1", "課題解決のための設計"],
  [1, "3.2", "制作物の紹介"],
  [1, "3.2.1", "入力方法とかな漢字変換機能"],
  [1, "3.2.2", "変換結果変更機能"],
  [1, "3.2.3", "打ち間違い修正機能"],
  [1, "3.3", "実装方法"],
  [1, "3.3.1", "概要"],
  [1, "3.3.2", "かな漢字変換機能・変換結果変更機能"],
  [1, "3.3.3", "打ち間違い修正機能"],
  [1, "4", "システムの評価と考察"],
  [1, "4.1", "考察と議論"],
  [1, "4.1.1", "打ち間違いを気にせず入力を続ける意識"],
  [1, "4.1.2", "スペースによる文節区切りにまつわる問題"],
  [1, "4.1.3", "打ち間違い修正機能の表⽰順序"],
  [1, "4.1.4", "アルファベットの⼊⼒について"],
  [1, "4.1.5", "⼊⼒⽅法の個⼈差への対応"],
  [1, "5", "関連研究"],
  [1, "5.1", "速記"],
  [1, "5.2", "SKKの変換方式"],
  [1, "5.3", "DeepL翻訳の変換結果修正インターフェース"],
  [1, "6", "まとめ"],
  [1, "", "謝辞"],
  [1, "", "参考文献"],
];

const pagenumSpan = (size, page) => {
  return `<span class="right font-mid size-${size}"> ${page} </span>`
}

let content = "# 目次\n\n"

for (let title of titles) {
  let [page, ver, str] = title

  // の数を数えて、その数だけ`#`をつける
  const size = ver.split(".").length
  const hprefix = `#`.repeat(size + 1)
  if (size === 1) {
    ver = `第${ver}章`
  }

  content += `${hprefix} ${ver}${str}${pagenumSpan(size, page)}\n\n`
}


const dir = import.meta.url.replace("/index.ts", "")
const dirja = decodeURI(dir).replace("file://", "")
await Bun.write(`${dirja}/index.md`, content)
